src/ex_Tabakon/Documents/ТБК_ВедомостьОПродажахЗаДень.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ТБК_ВедомостьОПродажахЗаДень</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Магазины</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаККМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыручкаЗаСменуПоКассе</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыручкаЗаСменуПоКассе_Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВедомостьПродажНеУчтено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВедомостьПродажНеУчтено_ПКО</Name>
					<Comment>:</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВедомостьПродажнеНеУчтено_Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплатаПоБанковскимКартам</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплатаНаличными</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвратОтПокупателяНал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвратОтПокупателяБезНал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасходыОтдела</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасходыОтдела_РКО</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасходыОтдела_Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗП_Продавца</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаличныеКСдаче</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗП_Продаца_Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗП_Продавца_РКО</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОплатаПоставщику</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаКакуюДату</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РКО</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтчетыОРозничныхПродажах</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОтчетОРозничныхПродажах</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОплатаПоБанковскимКартам</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОплатаНаличными</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВозвратОтПокупателяНал</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВозвратОтПокупателяБезНал</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Возвраты</Name>
				</Properties>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВыемкаДенежныхСредств</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Выемка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ВыемкаДенежныхСредствИзКассыККМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПКО</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Продавцы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Продавец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипПродавца</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТБКТипыПродавцов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяСмены</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПродавецНаЗамену</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Купюры5000</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>4</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Купюры2000</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>4</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/ex_Tabakon/Documents/ТБК_ВедомостьОПродажахЗаДень/Forms/ФормаДанныеПоВыручке/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Пока сумма не введена, в ячейке стоит текст-подсказка; в расчете разницы такие ячейки не участвуют.
	ПодсказкаZОтчет = НСтр("ru = 'Внести с z-отчета'");
	ДобавитьСтроку(НСтр("ru = 'Наличные'"), ЗначениеПараметра("ОплатаНаличными", 0),
		ЗначениеПараметра("НаличныйZ", ПодсказкаZОтчет),
		ЗначениеПараметра("НаличныйФакт", НСтр("ru = 'Пересчитать кассу и внести'")));
	ДобавитьСтроку(НСтр("ru = 'Безналичные'"), ЗначениеПараметра("ОплатаПоБанковскимКартам", 0),
		ЗначениеПараметра("БезНаличныйZ", ПодсказкаZОтчет),
		ЗначениеПараметра("БезНаличныйФакт", НСтр("ru = 'Внести с терминальной сверки'")));

	ТерминальнаяСверкаНеВышла = ЗначениеПараметра("ТерминальнаяСверкаНеВышла", Ложь);

	ПересчитатьРазницу(ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДанныеПоВыручке

&НаКлиенте
Процедура ДанныеПоВыручкеПриИзменении(Элемент)
	ПересчитатьРазницу(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ДанныеПоВыручкеПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДанныеПоВыручкеПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДанныеПоВыручкеZОтчетИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	ОтброситьНечисловыеСимволыВКонце(Элемент, Текст, "ZОтчет");
КонецПроцедуры

&НаКлиенте
Процедура ДанныеПоВыручкеФактическиИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	ОтброситьНечисловыеСимволыВКонце(Элемент, Текст, "Фактически");
КонецПроцедуры

&НаКлиенте
Процедура ДанныеПоВыручкеZОтчетОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ЗаписатьВведеннуюСумму(Текст, "ZОтчет");
КонецПроцедуры

&НаКлиенте
Процедура ДанныеПоВыручкеФактическиОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ЗаписатьВведеннуюСумму(Текст, "Фактически");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Результат читает ПослеВнесенияДанныхПоВыручке формы документа.
&НаКлиенте
Процедура ОК(Команда)

	Результат = Новый Структура;
	Результат.Вставить("НаличныйZ", ДанныеПоВыручке[0].ZОтчет);
	Результат.Вставить("БезНаличныйZ", ДанныеПоВыручке[1].ZОтчет);
	Результат.Вставить("НаличныйФакт", ДанныеПоВыручке[0].Фактически);
	Результат.Вставить("БезНаличныйФакт", ДанныеПоВыручке[1].Фактически);
	Результат.Вставить("ТерминальнаяСверкаНеВышла", ТерминальнаяСверкаНеВышла);
	Закрыть(Результат);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ДобавитьСтроку(ТипДС, По1с, ZОтчет, Фактически)

	НоваяСтрока = ДанныеПоВыручке.Добавить();
	НоваяСтрока.ТипДС = ТипДС;
	НоваяСтрока.По1с = По1с;
	НоваяСтрока.ZОтчет = ZОтчет;
	НоваяСтрока.Фактически = Фактически;

КонецПроцедуры

&НаСервере
Функция ЗначениеПараметра(ИмяПараметра, ЗначениеПоУмолчанию)

	Значение = Неопределено;
	Если Параметры.Свойство(ИмяПараметра, Значение) Тогда
		Возврат Значение;
	КонецЕсли;
	Возврат ЗначениеПоУмолчанию;

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ПересчитатьРазницу(Форма)

	ЕстьРазница = Ложь;
	Для Каждого СтрокаВыручки Из Форма.ДанныеПоВыручке Цикл
		СтрокаВыручки.РазницаZ = РазницаСВведеннойСуммой(СтрокаВыручки.По1с, СтрокаВыручки.ZОтчет);
		СтрокаВыручки.РазницаФакт = РазницаСВведеннойСуммой(СтрокаВыручки.По1с, СтрокаВыручки.Фактически);
		ЕстьРазница = ЕстьРазница Или СтрокаВыручки.РазницаZ <> 0 Или СтрокаВыручки.РазницаФакт <> 0;
	КонецЦикла;

	Форма.Элементы.Декорация1.Заголовок = ?(ЕстьРазница, НСтр("ru = 'Сообщить администратору о разнице'"), "");

КонецПроцедуры

// Разница между суммой по данным 1С и введенной. Пока в ячейке подсказка, а не сумма, разница нулевая.
&НаКлиентеНаСервереБезКонтекста
Функция РазницаСВведеннойСуммой(По1с, ВведенноеЗначение)

	Сумма = ВведеннаяСумма(ВведенноеЗначение);
	Возврат ?(Сумма = Неопределено, 0, По1с - Сумма);

КонецФункции

// Число из ячейки либо Неопределено, если в ячейке подсказка, а не сумма.
&НаКлиентеНаСервереБезКонтекста
Функция ВведеннаяСумма(ВведенноеЗначение)

	Если ТипЗнч(ВведенноеЗначение) = Тип("Число") Тогда
		Возврат ВведенноеЗначение;
	КонецЕсли;
	Если ТипЗнч(ВведенноеЗначение) <> Тип("Строка") Тогда
		Возврат Неопределено;
	КонецЕсли;

	// Суммы, сохраненные раньше, записаны с разделителем групп и запятой: «1 500,00».
	ТекстСуммы = СтрЗаменить(СтрЗаменить(ВведенноеЗначение, Символы.НПП, ""), ",", ".");
	Возврат СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ТекстСуммы);

КонецФункции

// Пока кассир вводит сумму, отрезает с конца до пяти символов, кроме цифр и точки.
&НаКлиенте
Процедура ОтброситьНечисловыеСимволыВКонце(Элемент, Текст, ИмяКолонки)

	МаксимумОтрезаемыхСимволов = 5;

	Элемент.ЦветТекста = WebЦвета.Черный;
	ОтрезаноСимволов = 0;
	Пока ОтрезаноСимволов < МаксимумОтрезаемыхСимволов И Не ЭтоЦифраИлиТочка(Прав(Текст, 1)) Цикл
		Текст = Сред(Текст, 1, СтрДлина(Текст) - 1);
		Элементы.ДанныеПоВыручке.ТекущиеДанные[ИмяКолонки] = Текст;
		ОтрезаноСимволов = ОтрезаноСимволов + 1;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Функция ЭтоЦифраИлиТочка(Символ)
	Возврат Символ <> "" И СтрНайти("0123456789.", Символ) > 0;
КонецФункции

// Сохраняет введенную сумму строкой с двумя знаками после точки; ноль - числом,
// нечисловой ввод - строкой «0». Разделитель групп не ставим: иначе сумму от 1000
// не прочитать обратно в число при расчете разницы.
&НаКлиенте
Процедура ЗаписатьВведеннуюСумму(Текст, ИмяКолонки)

	ТекущиеДанные = Элементы.ДанныеПоВыручке.ТекущиеДанные;
	Сумма = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Текст);
	Если Сумма = Неопределено Тогда
		ТекущиеДанные[ИмяКолонки] = "0";
	ИначеЕсли Сумма = 0 Тогда
		ТекущиеДанные[ИмяКолонки] = Сумма;
	Иначе
		ТекущиеДанные[ИмяКолонки] = Формат(Сумма, "ЧДЦ=2; ЧРД=.; ЧГ=0");
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
